In [1]:
import pandas as pd
import warnings as wr
wr.filterwarnings('ignore')

names=['Loan_ID','Gender','Married','Dependents','Education','Self_Employed','Applicant_Income','Coapplicant_Income','Loan_Amount','Loan_Amount_Term','Credit_History','Property_Area','Loan_Status']
data=pd.read_csv("loanpred.csv", names=names)

df = data.head(100)

In [2]:

df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,Applicant_Income,Coapplicant_Income,Loan_Amount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128,360,1,Rural,N
1,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66,360,1,Urban,Y
2,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120,360,1,Urban,Y
3,LP001008,Male,No,0,Graduate,No,6000,0.0,141,360,1,Urban,Y
4,LP001011,Male,Yes,2,Graduate,Yes,5417,4196.0,267,360,1,Urban,Y

In [3]:
df['Self_Employed'].unique()

array(['No', 'Yes'], dtype=object)

In [4]:
df['Applicant_Income'].unique()

array([ 4583,  3000,  2583,  6000,  5417,  2333,  3036,  4006, 12841,
        3200,  3073,  1853,  1299,  4950,  3510,  4887,  7660,  5955,
        2600,  9560,  2799,  4226,  1442,  3167,  4692,  3500, 12500,
        3667,  4166,  3748,  3600,  1800,  3941,  5649,  5821,  2645,
        4000,  1928,  3086,  4230,  4616, 11500,  2708,  2132,  3366,
        8080,  3357,  2500,  3029,  2609,  5726, 10750,  7100,  4300,
        3208,  1875,  5266,  3750,  1000,  3846,  1378,  3988,  2366,
        8566,  5695,  2958,  6250,  3273,  4133,  3620,  2484,  1977,
        4188,  1759,  4288,  4843,  3052, 11417,  3800,  2071,  5316,
       14583,  5568, 10408,  2137,  2957, 10513,  2014,  2718,  3459,
        4895], dtype=int64)

In [5]:
df['Credit_History'].unique()

array([1, 0], dtype=int64)

In [6]:
df['Loan_Amount_Term'].unique()

array([360, 120, 180,  60, 300, 480, 240], dtype=int64)

In [7]:
df.describe()

,Applicant_Income,Coapplicant_Income,Loan_Amount,Loan_Amount_Term,Credit_History
count,100.000000,100.000000,100.000000,100.000000,100.000000
mean,4422.610000,1793.850000,136.100000,337.200000,0.860000
std,2705.917906,2092.857316,64.862637,70.210074,0.348735
min,1000.000000,0.000000,17.000000,60.000000,0.000000
25%,2778.750000,0.000000,99.750000,360.000000,1.000000
50%,3707.500000,1521.000000,125.500000,360.000000,1.000000
75%,4908.750000,2608.250000,167.250000,360.000000,1.000000
max,14583.000000,10968.000000,349.000000,480.000000,1.000000

In [8]:
df.isnull().any().any()

False

In [9]:
df.isnull().any().sum()

0

In [10]:
df.columns.str.title()

Index(['Loan_Id', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'Applicant_Income', 'Coapplicant_Income',
       'Loan_Amount', 'Loan_Amount_Term', 'Credit_History', 'Property_Area',
       'Loan_Status'],
      dtype='object')

In [11]:
c = 0
gender_dict = {}
for i in set(df.Gender):
    gender_dict[i] = c
    c = c+1
    
    
for i in range(len(df)):
    temp = df.Gender[i]
    df.Gender[i] = gender_dict[temp]

In [12]:
c= 0
dep_dict ={}
for i in set(df.Dependents):
    dep_dict[i]= c
    c= c+1
    
for i in range(len(df)):
    temp = df.Dependents[i]
    df.Dependents[i]=dep_dict[temp]

In [13]:
c= 0
self_dict ={}
for i in set(df.Self_Employed):
    self_dict[i]= c
    c= c+1
    
for i in range(len(df)):
    temp = df.Self_Employed[i]
    df.Self_Employed[i]=self_dict[temp]

In [14]:
c = 0
mar_dict = {}
for i in set(df.Married):
    mar_dict[i] = c
    c = c+1
    
    
for i in range(len(df)):
    temp = df.Married[i]
    df.Married[i] = mar_dict[temp]

In [15]:
c = 0
edu_dict = {}
for i in set(df.Education):
    edu_dict[i] = c
    c = c+1
    
    
for i in range(len(df)):
    temp = df.Education[i]
    df.Education[i] = edu_dict[temp]

In [16]:
c = 0
prop_dict = {}
for i in set(df.Property_Area):
    prop_dict[i] = c
    c = c+1
    
    
for i in range(len(df)):
    temp = df.Property_Area[i]
    df.Property_Area[i] = prop_dict[temp]
    
prop_dict

{'Urban': 0, 'Semiurban': 1, 'Rural': 2}

In [17]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,Applicant_Income,Coapplicant_Income,Loan_Amount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001003,0,1,2,1,0,4583,1508.0,128,360,1,2,N
1,LP001005,0,1,1,1,1,3000,0.0,66,360,1,0,Y
2,LP001006,0,1,1,0,0,2583,2358.0,120,360,1,0,Y
3,LP001008,0,0,1,1,0,6000,0.0,141,360,1,0,Y
4,LP001011,0,1,3,1,1,5417,4196.0,267,360,1,0,Y

## Dropping unnecessary rows

In [18]:
df.drop('Loan_ID',inplace=True,axis=1)

## Combining Applicant_Income and Coapplicant_Income

In [19]:
income =  df['Applicant_Income'] + df['Coapplicant_Income' ]
df['Income']= income
df.head()

,Gender,Married,Dependents,Education,Self_Employed,Applicant_Income,Coapplicant_Income,Loan_Amount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Income
0,0,1,2,1,0,4583,1508.0,128,360,1,2,N,6091.0
1,0,1,1,1,1,3000,0.0,66,360,1,0,Y,3000.0
2,0,1,1,0,0,2583,2358.0,120,360,1,0,Y,4941.0
3,0,0,1,1,0,6000,0.0,141,360,1,0,Y,6000.0
4,0,1,3,1,1,5417,4196.0,267,360,1,0,Y,9613.0

## Finding Total loan amount to pay

In [20]:
total_loan = df['Loan_Amount_Term'] * df['Loan_Amount']
df['Total_Loan']= total_loan
df.head()

,Gender,Married,Dependents,Education,Self_Employed,Applicant_Income,Coapplicant_Income,Loan_Amount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Income,Total_Loan
0,0,1,2,1,0,4583,1508.0,128,360,1,2,N,6091.0,46080
1,0,1,1,1,1,3000,0.0,66,360,1,0,Y,3000.0,23760
2,0,1,1,0,0,2583,2358.0,120,360,1,0,Y,4941.0,43200
3,0,0,1,1,0,6000,0.0,141,360,1,0,Y,6000.0,50760
4,0,1,3,1,1,5417,4196.0,267,360,1,0,Y,9613.0,96120

In [21]:
df['Income'].describe()

count      100.000000
mean      6216.460000
std       3443.096083
min       1442.000000
25%       3932.250000
50%       5216.500000
75%       7225.250000
max      23809.000000
Name: Income, dtype: float64

In [22]:
df['Total_Loan'].describe()

count       100.00000
mean      46562.40000
std       24432.72756
min        2040.00000
25%       32400.00000
50%       43200.00000
75%       54630.00000
max      125640.00000
Name: Total_Loan, dtype: float64

In [23]:
24432.72756/3443.096083

7.096150374842734

In [24]:
df['Loan_Status'].describe()

count     100
unique      2
top         Y
freq       69
Name: Loan_Status, dtype: object

In [25]:
46562.40000/6216.460000

7.490179298185784

## Relating the loan amount and income

In [26]:
status = []
x = df['Income']*7.5
y = df['Total_Loan']
for i in range(len(df)):
    if x[i] <= y[i]:
        status.append(0)
    else:
        status.append(1)

In [27]:
df['Margin'] = status
df.head()

,Gender,Married,Dependents,Education,Self_Employed,Applicant_Income,Coapplicant_Income,Loan_Amount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Income,Total_Loan,Margin
0,0,1,2,1,0,4583,1508.0,128,360,1,2,N,6091.0,46080,0
1,0,1,1,1,1,3000,0.0,66,360,1,0,Y,3000.0,23760,0
2,0,1,1,0,0,2583,2358.0,120,360,1,0,Y,4941.0,43200,0
3,0,0,1,1,0,6000,0.0,141,360,1,0,Y,6000.0,50760,0
4,0,1,3,1,1,5417,4196.0,267,360,1,0,Y,9613.0,96120,0

In [28]:
count = 0
a= df['Margin']
b = df['Loan_Status']
for i in range(len(df)):
    if a[i] == b[i]:
        count = count+1
count

0

## splitting data into test and train data sets

In [29]:
from sklearn.model_selection import train_test_split
from sklearn import metrics # for checking the model accuracy


train, test = train_test_split(df, test_size=0.3) 


print(train.shape , test.shape)

(70, 15) (30, 15)

In [30]:
df.head()

,Gender,Married,Dependents,Education,Self_Employed,Applicant_Income,Coapplicant_Income,Loan_Amount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Income,Total_Loan,Margin
0,0,1,2,1,0,4583,1508.0,128,360,1,2,N,6091.0,46080,0
1,0,1,1,1,1,3000,0.0,66,360,1,0,Y,3000.0,23760,0
2,0,1,1,0,0,2583,2358.0,120,360,1,0,Y,4941.0,43200,0
3,0,0,1,1,0,6000,0.0,141,360,1,0,Y,6000.0,50760,0
4,0,1,3,1,1,5417,4196.0,267,360,1,0,Y,9613.0,96120,0

In [31]:
train_x = train[['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
                 'Loan_Amount','Loan_Amount_Term', 'Credit_History', 'Property_Area',
                 'Applicant_Income','Coapplicant_Income']]
train_y =train.Loan_Status


test_x =  test[['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
                 'Loan_Amount','Loan_Amount_Term', 'Credit_History', 'Property_Area',
                 'Applicant_Income','Coapplicant_Income']]
test_y = test.Loan_Status

In [32]:
from sklearn.linear_model import LogisticRegression

model = LogisticRegression()
model.fit(train_x, train_y)
prediction = model.predict(test_x)
print('The accuracy of Logistic Regression is: ', metrics.accuracy_score(prediction, test_y))

The accuracy of Logistic Regression is:  0.8

In [33]:
from sklearn.neighbors import KNeighborsClassifier

model = KNeighborsClassifier(n_neighbors=20) 
model.fit(train_x, train_y)
prediction = model.predict(test_x)
print('The accuracy of KNN is: ', metrics.accuracy_score(prediction, test_y))

The accuracy of KNN is:  0.6333333333333333

In [34]:
from sklearn import svm 
svm_model = svm.SVC() 

svm_model.fit(train_x, train_y)

prediction = svm_model.predict(test_x)
print('The accuracy of the SVM is: ', metrics.accuracy_score(prediction, test_y))

The accuracy of the SVM is:  0.6333333333333333

In [35]:
from sklearn.tree import DecisionTreeClassifier


model = DecisionTreeClassifier()
model.fit(train_x, train_y)
prediction = model.predict(test_x)
print('the accuracy of Decision tree classifier is:' ,metrics.accuracy_score(prediction,test_y))

the accuracy of Decision tree classifier is: 0.7333333333333333